app/controllers/assesments_controller.rb

  def index
    if !session[:assesment_ids].blank?
      @assesments = Assesment.find(session[:assesment_ids], :order => "created_at DESC")
---
SELECT * FROM "assesments" WHERE (id IN (1)) ORDER BY created_at DESC

    Dir.new(directory).each do |f|
      if f.ends_with? ".shp"
        #CREATE ASSESSMENT
        @assesment ||= Assesment.create(:file_name => file_name)
---
INSERT INTO "assesments" ("created_at", "updated_at", "file_name", "user_id", "delete_at", "state") VALUES('2011-03-01 11:59:06.813604', '2011-03-01 11:59:06.813604', E'tenements.zip', NULL, NULL, NULL) RETURNING "id"

        #READ IN AND CREATE TENEMENTS
        GeoRuby::Shp4r::ShpFile.open(File.join(directory,f)) do |shp|
          shp.each do |shape|
            @assesment.tenements.create :the_geom => shape.geometry, :attribute_data => shape.data
---
INSERT INTO "tenements" ("created_at", "attribute_data", "updated_at", "the_geom", "assesment_id", "encoded_polyline_cache", "query_area_km2", "query_area_carbon_kg") VALUES('2011-03-01 11:59:06.944832', E'--- !ruby/object:DBF::Record